/* Bank name when bank is offline for maintenance. */
"%@ - Offline" = "%@ Offline-tila";

/* Details of a saved card. &apos;{card brand} ending in {last 4}&apos; e.g. &apos;VISA ending in 4242&apos; */
"%1$@ ending in %2$@" = "%1$@ päättyy numeroihin %2$@";

/* Text for a button that, when tapped, displays another screen where the customer can add payment method details */
"+ Add" = "+ Lisää";

/* Text for a button that, when tapped, displays another screen where the customer can enter card details */
"+ Add card" = "+ Lisää kortti";

/* Source type brand name */
"3D Secure" = "3D Secure";

/* part of {Account} ending in {last4} */
"Account" = "Tili";

/* Title for address entry section */
"ACCOUNT HOLDER ADDRESS" = "TILINOMISTAJAN OSOITE";

/* Caption for Name field on bank info form */
"Account Holder Name" = "Tilinomistajan nimi";

/* Placeholder text for Account number entry field for BECS Debit. */
"Account number" = "Tilinumero";

/* Title for Add a Card view */
"Add a Card" = "Lisää kortti";

/* Title shown above a card entry form */
"Add a card" = "Lisää kortti";

/* Title for SEPA Debit Account form */
"Add a Direct Debit Account" = "Lisää suoraveloitustili";

/* Label of a button displayed below a card entry form that saves the card details */
"Add card" = "Lisää kortti";

/* Button to add a new credit card. */
"Add New Card…" = "Lisää uusi kortti...";

/* Text for a button that, when tapped, displays another screen where the customer can add payment method details */
"Add new payment method" = "Lisää uusi maksutapa";

/* Title shown above a form where the customer can enter payment information like credit card details, email, billing address, etc. */
"Add your payment information" = "Lisää maksutiedot";

/* Caption for Address field on address form */
"Address" = "Osoite";

/* Address line 1 placeholder for billing address form. */
"Address line 1" = "Osoiterivi 1";

/* Address line 2 placeholder for billing address form. */
"Address line 2 (optional)" = "Osoiterivi 2 (valinnainen)";

/* Payment Method type brand name */
"AfterpayClearpay" = "AfterpayClearpay";

/* Source type brand name */
"Alipay" = "Alipay";

/* Text for Apple Pay payment method */
"Apple Pay" = "Apple Pay";

/* Caption for Apartment/Address line 2 field on address form */
"Apt." = "Asunto";

/* This is a Payment Method type brand name so shouldn&apos;t be translated unless it has a different name in a given localization. */
"AU BECS Debit" = "AU BECS -veloitus";

/* Text for back button */
"Back" = "Takaisin";

/* Source type brand name */
"Bancontact" = "Bancontact";

/* Title for bank picker section */
"BANK" = "PANKKI";

/* Label for Bank Account selection or detail entry form */
"Bank Account" = "Pankkitili";

/* Title for bank account information form */
"BANK ACCOUNT INFORMATION" = "PANKKITILIN TIEDOT";

/* Title for billing address entry section */
"BILLING ADDRESS" = "LASKUTUSOSOITE";

/* Title for billing address entry section */
"Billing Address" = "Laskutusosoite";

/* Billing address section title for card form entry. */
"Billing address" = "Laskutusosoite";

/* Payment Method type brand name */
"BLIK" = "BLIK";

/* Placeholder text for BSB Number entry field for BECS Debit. */
"BSB" = "BSB";

/* SEPA legal authorization text – must use official translations. */
"By providing your IBAN and confirming this payment, you are authorizing %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and your bank to debit your account in accordance with those instructions. You are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited." = "Antamalla IBAN-tilinumeron ja vahvistamalla tämän maksun annat %@n ja Stripen, maksunhoitajamme, lähettää pankillesi ohjeet veloittaa tililtäsi ja annat pankkisi suorittaa veloitukset näiden ohjeiden mukaisesti. Sinulla on oikeus pankkisi maksamaan hyvitykseen pankin kanssa tekemäsi sopimuksen ehtojen mukaisesti. Hyvitystä on pyydettävä 8 viikon kuluessa päivästä, jolloin maksu veloitettiin tililtäsi.";

/* Button title to cancel action in an alert */
"Cancel" = "Peruuta";

/* Title for card number entry field */
"CARD" = "KORTTI";

/* Title for credit card number entry field */
"Card" = "Kortti";

/* Details of a saved card */
"Card ending in %@" = "Kortti, joka päättyy numeroihin %@";

/* Card details entry form header title */
"Card information" = "Kortin tiedot";

/* accessibility label for text field */
"card number" = "kortin numero";

/* Label for card number entry text field */
"Card number" = "Kortin numero";

/* TODO */
"Choose a payment method" = "Valitse maksutapa";

/* Caption for City field on address form */
"City" = "Paikkakunta";

/* Text for close button */
"Close" = "Sulje";

/* Accessibility label for the button to close the card scanner. */
"Close card scanner" = "Sulje korttiskanneri";

/* Title for contact info form */
"CONTACT" = "YHTEYSTIEDOT";

/* Title for contact info form */
"Contact" = "Yhteystiedot";

/* Text for continue button */
"Continue" = "Jatka";

/* Caption for Country field on address form */
"Country" = "Maa";

/* Title for country picker section */
"COUNTRY" = "MAA";

/* Country selector and postal code entry form header title */
"Country or region" = "Maa tai alue";

/* Caption for County field on address form (only countries that use county, like United Kingdom) */
"County" = "Lääni";

/* Label for entering CVC in text field */
"CVC" = "CVC-tunnus";

/* Label for entering CVV in text field */
"CVV" = "CVV-koodi";

/* Title for delivery info form */
"Delivery" = "Toimitus";

/* Title for delivery address entry section */
"DELIVERY ADDRESS" = "TOIMITUSOSOITE";

/* Title for delivery address entry section */
"Delivery Address" = "Toimitusosoite";

/* Done button title */
"Done" = "Valmis";

/* Button title to enter editing mode */
"Edit" = "Muokkaa";

/* Caption for Email field on address form */
"Email" = "Sähköposti";

/* Source type brand name */
"EPS" = "EPS";

/* Placeholder string for email entry field. */
"example@example.com" = "esimerkki@esimerkki.com";

/* accessibility label for text field */
"expiration date" = "erääntymispäivä";

/* Payment Method type brand name */
"FPX" = "FPX";

/* Label for free shipping method */
"Free" = "Maksuton";

/* Placeholder string for name entry field. */
"Full name" = "Koko nimi";

/* Source type brand name */
"Giropay" = "Giropay";

/* Payment Method type brand name. */
"giropay" = "giropay";

/* Payment Method type brand name. */
"GrabPay" = "GrabPay";

/* IBAN placeholder – don&apos;t translate */
"IBAN" = "IBAN";

/* Source type brand name */
"iDEAL" = "iDEAL";

/* iDEAL bank section title for iDEAL form entry. */
"iDEAL Bank" = "iDEAL-pankki";

/* Spoken during VoiceOver when a form field has failed validation. */
"Invalid data." = "Virheelliset tiedot.";

/* Shipping form error message */
"Invalid Shipping Address" = "Toimitusosoite ei kelpaa";

/* Source type brand name */
"Klarna" = "Klarna";

/* Title for screen when data is still loading from the network. */
"Loading…" = "Lataa...";

/* label for text field to enter card expiry */
"MM / YY" = "KK/VV";

/* label for text field to enter card expiry */
"MM/YY" = "KK/VV";

/* Title for payment options section */
"MORE OPTIONS" = "LISÄÄ VAIHTOEHTOJA";

/* Source type brand name */
"Multibanco" = "Multibanco";

/* Caption for Name field on address form */
"Name" = "Nimi";

/* Payment Method type brand name */
"NetBanking" = "NetBanking";

/* Label for button to add a new credit or debit card */
"New Card" = "Uusi kortti";

/* Label for button to add a new SEPA Direct Debit account */
"New Direct Debit Account" = "Uusi suoraveloitustili";

/* Accessibility label for button to add a new SEPA Direct Debit account */
"New SEPA Direct Debit Account" = "Uusi SEPA-suoraveloitustili";

/* Button to move to the next text entry field */
"Next" = "Seuraava";

/* No comment provided by engineer. */
"OK" = "OK";

/* Button to pay with a Bank Account (using FPX). */
"Online Banking (FPX)" = "Verkkopankki (FPX)";

/* Title of a section displayed below an Apple Pay button. The section contains alternative ways to pay. */
"Or pay using" = "Tai käytä maksutapaa";

/* Title of a section displayed below an Apple Pay button. The section contains a credit card form as an alternative way to pay. */
"Or pay with a card" = "Tai maksa kortilla";

/* Payment Method type brand name */
"OXXO" = "OXXO";

/* Source type brand name */
"P24" = "P24";

/* Label of a button that initiates payment when tapped */
"Pay %@" = "Maksa %@";

/* Pay with {payment method} */
"Pay with %@" = "Maksutapa: %@";

/* Title for Payment Method screen */
"Payment Method" = "Maksutapa";

/* Payment Method type brand name */
"PayPal" = "PayPal";

/* Caption for Phone field on address form */
"Phone" = "Puhelin";

/* Accessibility instructions for card scanning. */
"Point the camera at your card." = "Osoita kamera korttia kohti.";

/* Short string for postal code (text used in non-US countries). Please keep to 8 characters or less if possible. */
"Postal" = "Postinro";

/* Short string for postal code (text used in non-US countries) */
"Postal code" = "Postinumero";

/* Caption for Postal Code field on address form (only shown in countries other than the United States) */
"Postal Code" = "Postinumero";

/* Label of a button that, when tapped, initiates payment, becomes disabled, and displays this text */
"Processing..." = "Käsitellään...";

/* Caption for Province field on address form (only countries that use province, like Canada) */
"Province" = "Provinssi";

/* Payment Method type brand name. */
"Przelewy24" = "Przelewy24";

/* Button title for confirmation alert to remove a saved payment method
   Text for remove button */

"Remove" = "Poista";
/* Content for alert popup prompting to confirm removing saved payment method. */

"Remove %@" = "Poista %@";
/* Content for alert popup prompting to confirm removing a saved card. Remove {card brand} ending in {last 4} e.g. &apos;Remove VISA ending in 4242&apos; */

"Remove %1$@ ending in %2$@" = "Poista %1$@, joka päättyy numeroihin %2$@";
/* Title for confirmation alert to remove a card */

"Remove Card" = "Poista kortti";
/* The label of a switch indicating whether to save the user&apos;s card for future payments to this merchant */

"Save this card for future %@ payments" = "Tallenna tämä kortti tulevia maksuja (%@) varten";
/* Text for button to scan a credit card */

"Scan Card" = "Skannaa kortti";
/* Label of a button displayed below a payment method form. Tapping the button closes the form and uses the entered payment method details for checkout in the next step */

"Select" = "Valitse";
/* label for iDEAL-bank selection picker */

"Select bank" = "Valitse pankki";
/* Title shown above a carousel containing the customer&apos;s payment methods */

"Select your payment method" = "Valitse maksutapa";
/* part of {SEPA Account} ending in {last4} */

"SEPA Account" = "SEPA-tili";
/* Payment method brand name */

"SEPA Debit" = "SEPA Debit";
/* Source type brand name */

"SEPA Direct Debit" = "SEPA-suoraveloitus";
/* Label of a button displayed below a payment method form. Tapping the button sets the payment method up for future use */

"Set up" = "Määritä";
/* Title for shipping info form */

"Shipping" = "Toimitus";
/* Title for shipping address entry section */

"SHIPPING ADDRESS" = "TOIMITUSOSOITE";
/* Title for shipping address entry section */

"Shipping Address" = "Lähetysosoite";
/* Label for shipping method form */

"SHIPPING METHOD" = "TOIMITUSTAPA";
/* Label for shipping method form */

"Shipping Method" = "Toimitustapa";
/* Payment Method type brand name

   Source type brand name */
"Sofort" = "Sofort";

/* Source type brand name */
"SOFORT" = "SOFORT";

/* Caption for State field on address form (only countries that use state , like United States) */
"State" = "Osavaltio";

/* Caption for generalized state/province/region field on address form (not tied to a specific country&apos;s format) */
"State / Province / Region" = "Osavaltio/maakunta/alue";

/* Error string displayed to user when they have entered an incomplete BSB number. BSB refers to an Australian bank account number */
"The BSB you entered is incomplete." = "Antamasi BSB-numero on puutteellinen.";

/* Error string displayed to user when they enter in an invalid BSB number. &quot;BSB&quot; refers to an Australian bank account. */
"The BSB you entered is invalid." = "Antamasi BSB-numero on virheellinen.";

/* Error when the seleted payment method is not available (eg attempted to use 3D Secure on a card that does not support it). */
"The selected payment method is not available." = "Valittu maksutapa ei ole käytettävissä.";

/* Error when there is a problem processing the credit card */
"There was an error processing your card -- try again in a few seconds" = "Kortin käsittelyssä tapahtui virhe – kokeile uudelleen muutaman sekunnin kuluttua";

/* Unexpected error, such as a 500 from Stripe or a JSON parse error */
"There was an unexpected error -- try again in a few seconds" = "Odottamaton virhe – kokeile uudelleen muutaman sekunnin kuluttua";

/* Error when 3DS2 authentication timed out. */
"Timed out authenticating your payment method -- try again" = "Maksutapasi todennus aikakatkaistiin – yritä uudelleen.";

/* Error when the user hasn&apos;t allowed the current app to access the camera when scanning a payment card. &apos;Settings&apos; is the localized name of the iOS Settings app. */
"To scan your card, allow camera access in Settings." = "Anna kameralle käyttöoikeus, jotta voit skannata kortin.";

/* Button to reload web view if we were unable to connect. */
"Try again" = "Yritä uudelleen";

/* Error message that displays when we&apos;re unable to connect to the server. */
"Unable to establish a connection." = "Yhteyttä ei voida muodostaa.";

/* Default missing source type label */
"Unknown" = "Tuntematon";

/* Payment Method type brand name */
"UPI" = "UPI";

/* Button to fill shipping address from billing address. */
"Use Billing" = "Käytä laskutusosoitetta";

/* Button to fill billing address from delivery address. */
"Use Delivery" = "Käytä toimitusosoitetta";

/* Button to fill billing address from shipping address. */
"Use Shipping" = "Käytä lähetysosoitetta";

/* Displays in the navigation bar title of the Identity Verification Sheet */
"Verify your identity" = "Vahvista henkilöllisyytesi";

/* Error when 3DS2 authentication failed (e.g. customer entered the wrong code) */
"We are unable to authenticate your payment method. Please choose a different payment method and try again." = "Emme pystyneet todentamaan maksutapaasi. Valitse toinen maksutapa ja yritä uudelleen.";

/* Source type brand name */
"WeChat Pay" = "WeChat Pay";

/* You&apos;ll be taken to {bank name} to finish your purchase. */
"You'll be taken to %@ to finish your purchase." = "Sinut viedään pankkiin %@ ostoksen viimeistelemiseksi.";

/* Error when the card has already expired */
"Your card has expired" = "Korttisi on vanhentunut";

/* Error message for card form when card number is incomplete */
"Your card number is incomplete." = "Kortin numero on puutteellinen.";

/* Error message for card form when card number is invalid */
"Your card number is invalid." = "Kortin numero on virheellinen.";

/* Error when the card was declined by the credit card networks */
"Your card was declined" = "Korttiasi ei hyväksytty";

/* Error message for card details form when expiration date isn&apos;t entered completely */
"Your card's expiration date is incomplete." = "Kortin voimassaoloaika on puutteellinen.";

/* Error message for card details form when expiration date is invalid */
"Your card's expiration date is invalid." = "Kortin voimassaoloaika on virheellinen.";

/* Error when the card&apos;s expiration month is not valid */
"Your card's expiration month is invalid" = "Kortin erääntymiskuukausi ei kelpaa";

/* String to describe an invalid month in expiry date. */
"Your card's expiration month is invalid." = "Kortin erääntymiskuukausi ei kelpaa.";

/* Error when the card&apos;s expiration year is not valid */
"Your card's expiration year is invalid" = "Kortin erääntymisvuosi ei kelpaa";

/* String to describe an invalid year in expiry date. */
"Your card's expiration year is invalid." = "Kortin voimassaolovuosi ei kelpaa.";

/* Error when the card number is not valid */
"Your card's number is invalid" = "Kortin numero ei kelpaa";

/* Error message for card entry form when CVC/CVV is incomplete. */
"Your card's security code is incomplete." = "Kortin turvakoodi on puutteellinen.";

/* Error when the card&apos;s CVC is not valid */
"Your card's security code is invalid" = "Kortin turvakoodi ei kelpaa";

/* Error message for card entry form when CVC/CVV is invalid */
"Your card's security code is invalid." = "Kortin turvakoodi on virheellinen.";

/* Error message for when postal code in form is incomplete */
"Your postal code is incomplete." = "Postinumero on puutteellinen.";

/* Error message for when postal code in form is invalid */
"Your postal code is invalid." = "Postinumeroon virheellinen.";

/* Error message for when ZIP code in form is incomplete (US only) */
"Your ZIP is incomplete." = "Postinumero on puutteellinen.";

/* Error message for when postal code in form is invalid (US only) */
"Your ZIP is invalid." = "Postinumero on virheellinen.";

/* Short string for zip code (United States only) Please keep to 5 characters or less if possible. */
"ZIP" = "Postinumero";

/* Caption for Zip Code field on address form (only shown when country is United States only) */
"ZIP Code" = "Postinumero";

